In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['x','x','y','y','z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1': np.random.randn(5),
                   'dataset2': np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha
1  0.236992  0.710299  x   beta
2  0.623583 -0.088817  y  alpha
3 -2.156411  0.658082  y   beta
4  0.278620  0.235008  z  alpha

In [5]:
# grab datset1 and group by k1 key

group1 = dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group1 # tags the data as part of this group that pertains to k1 and dataset1

In [7]:
group1.mean()   # gives the average of the alpha and beta values (k2) of dataset1
                # associated with each k1 value

k1
x    0.633272
y   -0.766414
z    0.278620
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.236992
    JAN    0.623583
NY  FEB   -2.156411
    JAN    0.654087
Name: dataset1, dtype: float64

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
x   0.633272  0.051725
y  -0.766414  0.284633
z   0.278620  0.235008

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
x  alpha  1.029553 -0.606849
   beta   0.236992  0.710299
y  alpha  0.623583 -0.088817
   beta  -2.156411  0.658082
z  alpha  0.278620  0.235008

In [12]:
dframe.groupby(['k1']).size()

k1
x    2
y    2
z    1
dtype: int64

In [13]:
dframe

   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha
1  0.236992  0.710299  x   beta
2  0.623583 -0.088817  y  alpha
3 -2.156411  0.658082  y   beta
4  0.278620  0.235008  z  alpha

In [19]:
# iterate over groups

for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the x group
   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha
1  0.236992  0.710299  x   beta


This is the y group
   dataset1  dataset2 k1     k2
2  0.623583 -0.088817  y  alpha
3 -2.156411  0.658082  y   beta


This is the z group
   dataset1  dataset2 k1     k2
4   0.27862  0.235008  z  alpha

In [20]:
for name,group in dframe.groupby('k2'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the alpha group
   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha
2  0.623583 -0.088817  y  alpha
4  0.278620  0.235008  z  alpha


This is the beta group
   dataset1  dataset2 k1    k2
1  0.236992  0.710299  x  beta
3 -2.156411  0.658082  y  beta

In [26]:
for (k1,k2),group in dframe.groupby(['k1','k2']):
    print ("key1 = %s \tKey2 = %s" %(k1,k2))
    print (group)
    print ('\n')

key1 = x 	Key2 = alpha
   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha


key1 = x 	Key2 = beta
   dataset1  dataset2 k1    k2
1  0.236992  0.710299  x  beta


key1 = y 	Key2 = alpha
   dataset1  dataset2 k1     k2
2  0.623583 -0.088817  y  alpha


key1 = y 	Key2 = beta
   dataset1  dataset2 k1    k2
3 -2.156411  0.658082  y  beta


key1 = z 	Key2 = alpha
   dataset1  dataset2 k1     k2
4   0.27862  0.235008  z  alpha

In [27]:
# create a dictionary

group_dict = dict(list(dframe.groupby('k1')))

In [29]:
group_dict['x']

   dataset1  dataset2 k1     k2
0  1.029553 -0.606849  x  alpha
1  0.236992  0.710299  x   beta

In [30]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [31]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.029553 -0.606849
 1  0.236992  0.710299
 2  0.623583 -0.088817
 3 -2.156411  0.658082
 4  0.278620  0.235008, dtype('O'):   k1     k2
 0  x  alpha
 1  x   beta
 2  y  alpha
 3  y   beta
 4  z  alpha}

In [35]:
# groupby with columns

dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
x  alpha -0.606849
   beta   0.710299
y  alpha -0.088817
   beta   0.658082
z  alpha  0.235008

In [36]:
dataset2_group = dframe.groupby(['k1','k2'])['dataset2']
dataset2_group.mean()

k1  k2
x   alpha   -0.606849
    beta     0.710299
y   alpha   -0.088817
    beta     0.658082
z   alpha    0.235008
Name: dataset2, dtype: float64